app/views/pages/profile.html.erb

            <center><img src="/Default-Avatar.jpg" height="200px" width="200px" class="rounded-img"></center>
            <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "username"]]

            <div class = "posts">
              <a href = "/user/<%= User.find(@p.user_id).username %>"><%= User.find(@p.user_id).username %><span class = "post-time"> <%= @p.created_at.to_formatted_s(:short)%></span></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT "posts".* FROM "posts" WHERE (user_id = 6)  ORDER BY "posts"."created_at" DESC

              <p>Posts</p>
              <strong><%= current_user.posts.count %></strong>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]