app/controllers/pages_controller.rb

  def home
    following = Array.new
    #checks the database for who the user is following.
    for @f in current_user.following do
      following.push(@f.id)
    end

    #only posts from users in the following array are collected.
    @posts = Post.all.where("user_id = ?", following)
---
SELECT "posts".* FROM "posts" WHERE (user_id IN (NULL))  ORDER BY "posts"."created_at" DESC

  def profile
    # grab the username from the URL as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      # redirect to root
      redirect_to root_path, :notice=> "User not found!"
    end

    #only posts by that specific user are collected from the database
    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "userame"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (user_id = 6)  ORDER BY "posts"."created_at" DESC

  def explore
    #all posts are collected from the database
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC